app/controllers/grade_sets_controller.rb

SELECT "grade_sets".* FROM "grade_sets"
---
  def index
    @grade_sets = GradeSet.all