app/controllers/grade_sets_controller.rb

  def index
    @grade_sets = GradeSet.all.order(:year)
---
SELECT "grade_sets".* FROM "grade_sets" ORDER BY "grade_sets"."year" ASC

  def new
    @grade_set = GradeSet.new
    @students = Student.all
---
SELECT "students".* FROM "students"

  def edit
    @students = Student.all
---
SELECT "students".* FROM "students"

  def create
    @grade_set = GradeSet.new(grade_set_params)

    respond_to do |format|
      if @grade_set.save
---
INSERT INTO "grade_sets" ("year", "grade1", "grade2", "grade3", "grade4", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @grade_set.update(grade_set_params)
---
UPDATE "grade_sets" SET "grade4" = ?, "updated_at" = ? WHERE "grade_sets"."id" = ?  [["grade4", #<BigDecimal:7fb62818e3c8,'0.0',9(18)>], ["updated_at", 2016-11-19 16:10:24 UTC], ["id", 1]]

    def set_grade_set
      @grade_set = GradeSet.find(params[:id])
---
SELECT  "grade_sets".* FROM "grade_sets" WHERE "grade_sets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]