app/controllers/reports_controller.rb

  def show
  	@student = Student.where(cpf:params["cpf"]).first;
---
SELECT  "students".* FROM "students" WHERE "students"."cpf" = ? ORDER BY "students"."id" ASC LIMIT ?  [["cpf", "5445"], ["LIMIT", 1]]