app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("cpf", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["cpf", "888.888.888-88"], ["name", "Rubens"], ["created_at", 2016-11-19 14:39:29 UTC], ["updated_at", 2016-11-19 14:39:29 UTC]]

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "cpf" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["cpf", "123.123.123-12"], ["updated_at", 2016-11-19 15:10:27 UTC], ["id", 2]]