app/views/reports/show.html.erb

  <tbody>
    <% @student.grade_sets.each do |grade_set| %>
---
SELECT "grade_sets".* FROM "grade_sets" WHERE "grade_sets"."student_id" = ?  [["student_id", 1]]